app/controllers/cards_controller.rb

    def show
        card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 238], ["LIMIT", 1]]