app/controllers/decks_controller.rb

    def show
        deck = Deck.find(params[:id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]